nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1189/mcuxpresso/startup_mimxrt1189_cm7.c
WEAK void SAI2_IRQHandler(void)
{   SAI2_DriverIRQHandler();
}

WEAK void SAI3_IRQHandler(void)
{   SAI3_DriverIRQHandler();
}

WEAK void ACMP1_IRQHandler(void)
{   ACMP1_DriverIRQHandler();
}

WEAK void ACMP2_IRQHandler(void)
{   ACMP2_DriverIRQHandler();
}

WEAK void ACMP3_IRQHandler(void)
{   ACMP3_DriverIRQHandler();
}

WEAK void ACMP4_IRQHandler(void)
{   ACMP4_DriverIRQHandler();
}

WEAK void CM7_PS_IRQHandler(void)
{   CM7_PS_DriverIRQHandler();
}

WEAK void CM7_MCM_IRQHandler(void)
{   CM7_MCM_DriverIRQHandler();
}

WEAK void CM33_MCM_IRQHandler(void)
{   CM33_MCM_DriverIRQHandler();
}

WEAK void ECAT_INT_IRQHandler(void)
{   ECAT_INT_DriverIRQHandler();
}

WEAK void SAFETY_CLK_MON_IRQHandler(void)
{   SAFETY_CLK_MON_DriverIRQHandler();
}

WEAK void GPT1_IRQHandler(void)
{   GPT1_DriverIRQHandler();
}

WEAK void GPT2_IRQHandler(void)
{   GPT2_DriverIRQHandler();
}

WEAK void KPP_IRQHandler(void)
{   KPP_DriverIRQHandler();
}

WEAK void USBPHY1_IRQHandler(void)
{   USBPHY1_DriverIRQHandler();
}

WEAK void USBPHY2_IRQHandler(void)
{   USBPHY2_DriverIRQHandler();
}

WEAK void USB_OTG2_IRQHandler(void)
{   USB_OTG2_DriverIRQHandler();
}

WEAK void USB_OTG1_IRQHandler(void)
{   USB_OTG1_DriverIRQHandler();
}

WEAK void FLEXSPI_SLV_IRQHandler(void)
{   FLEXSPI_SLV_DriverIRQHandler();
}

WEAK void NETC_IRQHandler(void)
{   NETC_DriverIRQHandler();
}

WEAK void MSGINTR1_IRQHandler(void)
{   MSGINTR1_DriverIRQHandler();
}

WEAK void MSGINTR2_IRQHandler(void)
{   MSGINTR2_DriverIRQHandler();
}

WEAK void MSGINTR3_IRQHandler(void)
{   MSGINTR3_DriverIRQHandler();
}

WEAK void MSGINTR4_IRQHandler(void)
{   MSGINTR4_DriverIRQHandler();
}

WEAK void MSGINTR5_IRQHandler(void)
{   MSGINTR5_DriverIRQHandler();
}

WEAK void MSGINTR6_IRQHandler(void)
{   MSGINTR6_DriverIRQHandler();
}

WEAK void SINC1_CH0_IRQHandler(void)
{   SINC1_CH0_DriverIRQHandler();
}

WEAK void SINC1_CH1_IRQHandler(void)
{   SINC1_CH1_DriverIRQHandler();
}

WEAK void SINC1_CH2_IRQHandler(void)
{   SINC1_CH2_DriverIRQHandler();
}

WEAK void SINC1_CH3_IRQHandler(void)
{   SINC1_CH3_DriverIRQHandler();
}

WEAK void SINC2_CH0_IRQHandler(void)
{   SINC2_CH0_DriverIRQHandler();
}

WEAK void SINC2_CH1_IRQHandler(void)
{   SINC2_CH1_DriverIRQHandler();
}

WEAK void SINC2_CH2_IRQHandler(void)
{   SINC2_CH2_DriverIRQHandler();
}

WEAK void SINC2_CH3_IRQHandler(void)
{   SINC2_CH3_DriverIRQHandler();
}

WEAK void GPIO4_IRQHandler(void)
{   GPIO4_DriverIRQHandler();
}

WEAK void TMR2_IRQHandler(void)
{   TMR2_DriverIRQHandler();
}

WEAK void GPIO5_IRQHandler(void)
{   GPIO5_DriverIRQHandler();
}

WEAK void ASRC_IRQHandler(void)
{   ASRC_DriverIRQHandler();
}

WEAK void GPIO6_IRQHandler(void)
{   GPIO6_DriverIRQHandler();
}

WEAK void DBG_TRACE_IRQHandler(void)
{   DBG_TRACE_DriverIRQHandler();
}

WEAK void ECAT_RST_OUT_IRQHandler(void)
{   ECAT_RST_OUT_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
